## ÖDEV 8

**1-Test veritabanınızda employee isimli sütun bilgileri id(INTEGER), name VARCHAR(50), birthday DATE, email VARCHAR(100) olan bir tablo oluşturalım.**

<pre>
CREATE TABLE employee (
	id INTEGER, 
	first_name VARCHAR(50),
	birthday DATE,
	email VARCHAR(100)
);
<pre>

**2-Oluşturduğumuz employee tablosuna 'Mockaroo' servisini kullanarak 50 adet veri ekleyelim.**

<pre>
nsert into employee (id, first_name, birthday, email) values (1, 'Trumann', '1997-03-12', 'tviste0@imdb.com');
insert into employee (id, first_name, birthday, email) values (2, 'Dory', '1994-07-01', 'dvickarman1@narod.ru');
insert into employee (id, first_name, birthday, email) values (3, 'Sky', '1996-12-20', 'salten2@bravesites.com');
insert into employee (id, first_name, birthday, email) values (4, 'Harmon', '1995-09-23', 'helam3@naver.com');
insert into employee (id, first_name, birthday, email) values (5, 'Pepi', '1991-04-27', 'pkaas4@ameblo.jp');
insert into employee (id, first_name, birthday, email) values (6, 'Hamnet', '2000-04-29', 'hdelcastello5@nasa.gov');
insert into employee (id, first_name, birthday, email) values (7, 'Mandi', '1994-05-02', 'mfazakerley6@usnews.com');
insert into employee (id, first_name, birthday, email) values (8, 'Georgianna', '2000-10-29', 'gerbe7@quantcast.com');
insert into employee (id, first_name, birthday, email) values (9, 'Shermie', '1992-05-01', 'sballam8@wunderground.com');
insert into employee (id, first_name, birthday, email) values (10, 'Gardie', '1995-07-24', 'gcleeton9@mashable.com');
insert into employee (id, first_name, birthday, email) values (11, 'Chere', '1992-01-05', 'cstickelsa@weebly.com');
insert into employee (id, first_name, birthday, email) values (12, 'Tonya', '1993-10-30', 'toverstreetb@trellian.com');
insert into employee (id, first_name, birthday, email) values (13, 'Mahmud', '1998-07-05', 'mchristaeasc@wsj.com');
insert into employee (id, first_name, birthday, email) values (14, 'Krystal', '1997-06-12', 'kpaced@cbc.ca');
insert into employee (id, first_name, birthday, email) values (15, 'Lonnie', '1998-10-25', 'lcampbelle@pen.io');
insert into employee (id, first_name, birthday, email) values (16, 'Roma', '1994-11-15', 'rdormerf@go.com');
insert into employee (id, first_name, birthday, email) values (17, 'Olwen', '1993-11-28', 'odunkersleyg@scientificamerican.com');
insert into employee (id, first_name, birthday, email) values (18, 'Eba', '1995-12-13', 'eocorrenh@wordpress.org');
insert into employee (id, first_name, birthday, email) values (19, 'Karia', '1998-06-05', 'kdowdlei@smh.com.au');
insert into employee (id, first_name, birthday, email) values (20, 'Winifred', '2000-05-28', 'wgargettj@eventbrite.com');
insert into employee (id, first_name, birthday, email) values (21, 'Ev', '1999-07-07', 'ekemmeyk@seesaa.net');
insert into employee (id, first_name, birthday, email) values (22, 'Phillie', '1999-08-25', 'pseakinl@mac.com');
insert into employee (id, first_name, birthday, email) values (23, 'Gardner', '1999-10-24', 'gpurdonm@guardian.co.uk');
insert into employee (id, first_name, birthday, email) values (24, 'Robers', '2001-01-03', 'rsimonellin@webeden.co.uk');
insert into employee (id, first_name, birthday, email) values (25, 'Ansley', '1997-04-20', 'ahickfordo@amazon.com');
insert into employee (id, first_name, birthday, email) values (26, 'Henryetta', '1992-10-29', 'hburgwynp@infoseek.co.jp');
insert into employee (id, first_name, birthday, email) values (27, 'Tristam', '1992-12-28', 'tgleadleq@mapy.cz');
insert into employee (id, first_name, birthday, email) values (28, 'Everard', '2000-03-29', 'edarrigrandr@naver.com');
insert into employee (id, first_name, birthday, email) values (29, 'Isidor', '1992-08-17', 'ieykelboschs@constantcontact.com');
insert into employee (id, first_name, birthday, email) values (30, 'Kelila', '1992-05-13', 'kbiddlestonet@engadget.com');
insert into employee (id, first_name, birthday, email) values (31, 'Boycie', '1993-05-04', 'bcantosu@apache.org');
insert into employee (id, first_name, birthday, email) values (32, 'Ardeen', '1994-03-15', 'ajedrzaszkiewiczv@booking.com');
insert into employee (id, first_name, birthday, email) values (33, 'Vladamir', '1994-03-13', 'vballisterw@earthlink.net');
insert into employee (id, first_name, birthday, email) values (34, 'Ester', '1993-07-25', 'edonneelyx@vistaprint.com');
insert into employee (id, first_name, birthday, email) values (35, 'Jojo', '1997-10-13', 'jdugally@taobao.com');
insert into employee (id, first_name, birthday, email) values (36, 'Archer', '1991-10-08', 'agrassiz@columbia.edu');
insert into employee (id, first_name, birthday, email) values (37, 'Jennine', '1998-11-09', 'jsewall10@godaddy.com');
insert into employee (id, first_name, birthday, email) values (38, 'Thomasin', '1992-03-21', 'tdaftor11@pen.io');
insert into employee (id, first_name, birthday, email) values (39, 'Franky', '1999-08-22', 'ffarans12@latimes.com');
insert into employee (id, first_name, birthday, email) values (40, 'Kimmie', '1991-02-25', 'kmacaloren13@163.com');
insert into employee (id, first_name, birthday, email) values (41, 'Eduardo', '1991-04-26', 'echishull14@engadget.com');
insert into employee (id, first_name, birthday, email) values (42, 'Ardeen', '1999-01-28', 'ablacklawe15@theguardian.com');
insert into employee (id, first_name, birthday, email) values (43, 'Davey', '1992-07-14', 'dwinsiowiecki16@tripadvisor.com');
insert into employee (id, first_name, birthday, email) values (44, 'Ame', '1995-03-02', 'amcphail17@walmart.com');
insert into employee (id, first_name, birthday, email) values (45, 'Ardene', '1996-09-17', 'abebbington18@ifeng.com');
insert into employee (id, first_name, birthday, email) values (46, 'Caesar', '1999-06-27', 'csoutham19@toplist.cz');
insert into employee (id, first_name, birthday, email) values (47, 'Hardy', '1998-02-13', 'hskpsey1a@wsj.com');
insert into employee (id, first_name, birthday, email) values (48, 'Joel', '1991-11-29', 'jworswick1b@xrea.com');
insert into employee (id, first_name, birthday, email) values (49, 'Tamar', '1998-02-26', 'tlegging1c@wordpress.com');
insert into employee (id, first_name, birthday, email) values (50, 'Teressa', '1994-11-06', 'tgoly1d@nbcnews.com');
<pre>

**3-Sütunların her birine göre diğer sütunları güncelleyecek 5 adet UPDATE işlemi yapalım.**

<pre>
UPDATE employee
SET first_name = 'Ali Ulvi',
	birthday = '1997-03-27',
	email = 'kasapoglu.aliulvi@gmail.com'
WHERE id=1
RETURNING * ;
<pre>

---------------------------------------------------------------------------------

<PRE>
UPDATE employee
SET id = 127,
	birthday = '1881-12-22',
	email = 'asdasdada@gmail.com'
WHERE first_name='Joel'
RETURNING * ;
<PRE>

---------------------------------------------------------------------------------

<PRE>
UPDATE employee
SET id = 61,
	first_name = 'Ali',
	email = 'aukas.co@gmail.com'
WHERE birthday='1997-03-27'
RETURNING * ;
<PRE>

---------------------------------------------------------------------------------

<PRE>
UPDATE employee
SET id = 2317,
	first_name = 'Ali Kasap',
	birthday='1010-10-10'
WHERE email='aukas.co@gmail.com'
RETURNING * ;
<PRE>

**4-Sütunların her birine göre ilgili satırı silecek 5 adet DELETE işlemi yapalım.**

<pre>
DELETE FROM employee
WHERE id=7
RETURNING *;
<pre>

------------------------------------------------------------------------------------------

<pre>
DELETE FROM employee
WHERE first_name='Franky'
RETURNING *;
<pre>

------------------------------------------------------------------------------------------

<pre>
DELETE FROM employee
WHERE birthday='1010-10-10'
RETURNING *;
<pre>

------------------------------------------------------------------------------------------

<pre>
DELETE FROM employee
WHERE email='ablacklawe15@theguardian.com'
RETURNING *;
<pre>